/**
********************************************************************************
*
* Макетное ПО для сигнализатора ультразвукового СУЗ 1
* Микроконтроллер STM32L010F4P6
* Разработал: Мелехин В.Н.
* Модуль кольцевого буфера USART
*
********************************************************************************
*/

#ifndef __USART_RING_H
#define __USART_RING_H

#include "main.h"

//---Определение наличия данных в буфере----------------------------------------
uint16_t uart_available(void);
//---Чтение из буфера-----------------------------------------------------------
uint8_t uart_read(void);
//---Очистка буфера-------------------------------------------------------------
void clear_uart_buff(void);

#endif /* __USART_RING_H */
