/**
********************************************************************************
*
* Макетное ПО для сигнализатора ультразвукового СУЗ 1
* Микроконтроллер STM32f030F4P6
* Разработал: Мелехин В.Н.
* Модуль обработки сигналов и фильтрации
*
********************************************************************************
*/

#ifndef __FILTERS_H
#define __FILTERS_H

#include "main.h"
#include "math.h"
#include "stdio.h"
#include "stdlib.h"
#include <stdint.h>

#define NUM_OF_DATA NUM_OF_BUTS
#define NUM_MIDDLE NUM_OF_BUTS

//---Среднее арифметическое-----------------------------------------------------
int midArifm(int *data);
//---Бегущее среднее арифметическое---------------------------------------------
float runMiddleArifm(int newVal);
//---Оптимизированное бегущее среднее-------------------------------------------
float runMiddleArifmOptim(float newVal);
//---Медиана на три значения----------------------------------------------------
int median(int newVal);
//---Mедианный фильтр на N значений---------------------------------------------
float findMedianN(int newVal);
//---Сортировка данных по возрастанию-------------------------------------------
void sort_data(uint32_t *data); 

#endif /* __FILTERS_H */
